{
  "metadata": {
    "version": "2.1.0",
    "last_updated": "2026-03-01T00:00:00Z",
    "data_source": "CV Pipeline",
    "enhancement_ready": true
  },
  "personal_info": {
    "name": "Adrian Wedd",
    "title": "AI Safety Researcher & Developer",
    "location": "Cygnet, Tasmania, Australia",
    "email": "adrian@adrianwedd.com",
    "website": "https://cv.adrianwedd.com",
    "github": "https://github.com/adrianwedd",
    "linkedin": "https://linkedin.com/in/adrianwedd",
    "tagline": "Building the systems I study — AI safety, multi-agent frameworks, and client delivery",
    "availability": "Currently freelancing and building — open to the right opportunity"
  },
  "professional_summary": "Systems builder, AI safety researcher, and adversarial thinker with nearly 45 years across the stack. The failure-first methodology didn't come from papers — it came from coordinating direct actions for Greenpeace's Actions unit against well-resourced opponents where getting the risk assessment wrong had real consequences. That operational security instinct runs through everything: seven years leading cybersecurity, penetration testing, and IDAM for Tasmania's public housing sector; three years of empirical AI red-teaming across 120+ models and 18,000+ adversarial prompts; and production AI systems with hallucination detection and content safety gates built in from the start. Currently freelancing across client delivery (healthcare ecosystems, multilingual sites, ops tooling) and independent AI safety research. AuDHD — the hyperfocus and pattern recognition are features, not bugs. Most interested in where complex systems break and what that reveals about how they were built.",
  "experience": [
    {
      "position": "Freelance Developer & AI Consultant",
      "company": "Independent",
      "location": "Tasmania, Australia",
      "period": "2025 - Present",
      "type": "Freelance",
      "description": "Delivering client web projects and independent AI safety research. Specialising in red-teaming, adversarial testing, evaluation frameworks, and failure-first methodology for frontier AI models. Building multi-agent systems, LLM tooling, and open-source AI safety infrastructure.",
      "achievements": [
        "Designed and built red-teaming and adversarial testing framework for embodied AI with automated attack adapters (TAP) and cross-modal vulnerability research on VLA models",
        "Developed evaluation frameworks with hallucination detection, content safety gates, and model monitoring for production LLM pipelines",
        "Applied prompt engineering, RAG, and retrieval-augmented generation across multiple agentic systems",
        "Delivered four-site healthcare digital presence with AHPRA regulatory compliance and REST API integration",
        "Built 10+ active open-source repositories: agent orchestration, AI governance, NLP tooling, and CLI automation",
        "Developed multi-agent orchestration system with LangGraph, LangChain, and Anthropic SDK"
      ],
      "technologies": [
        "Python",
        "JavaScript",
        "TypeScript",
        "LangChain",
        "LangGraph",
        "Anthropic SDK",
        "Claude API",
        "Prompt Engineering",
        "RAG",
        "Red-teaming",
        "Adversarial Testing",
        "Evaluation Framework",
        "Hallucination Detection",
        "Content Safety",
        "Multi-Agent Systems",
        "GitHub Actions",
        "Docker",
        "FastAPI",
        "NLP"
      ]
    },
    {
      "position": "Systems Analyst / Acting Senior Change Analyst",
      "company": "Homes Tasmania (formerly Department of Communities Tasmania)",
      "location": "Tasmania, Australia",
      "period": "2018 - Feb 2026",
      "type": "Full-time",
      "description": "Led systems integration, cybersecurity, and digital transformation for Tasmania's public housing sector. Delivered penetration testing, vulnerability assessment, and identity and access management (IDAM) improvements. Deployed automation and AI tooling to improve service delivery for vulnerable communities.",
      "achievements": [
        "Designed and implemented RESTful API integrations and SFTP data exchange for the Housing Management System",
        "Led cybersecurity program including vulnerability assessment, penetration testing, and Essential Eight compliance uplift",
        "Implemented identity and access management (IDAM) controls reducing unauthorised access risk",
        "Built Python and PowerShell automation scripts for operational workflows, reducing manual processing time",
        "Pioneered responsible AI adoption for data analysis and decision support, including prompt engineering and LLM integration",
        "Developed ISO 27001-aligned information security practices across the department"
      ],
      "technologies": [
        "Python",
        "PowerShell",
        "JavaScript",
        "RESTful APIs",
        "SFTP",
        "SQL",
        "Azure",
        "Penetration Testing",
        "IDAM",
        "Essential Eight",
        "ISO 27001",
        "Prompt Engineering"
      ]
    },
    {
      "position": "ITS Client Services Officer",
      "company": "University of Tasmania",
      "location": "Tasmania, Australia",
      "period": "2015 - 2018",
      "type": "Concurrent",
      "description": "IT support across the full university user base — researchers, academics, administrative staff. Exposure to an unusually wide range of systems and problems built the diagnostic instinct that carries through everything since.",
      "achievements": [
        "Sole support contact for a diverse user base with no tolerance for downtime — learned to triage fast and fix faster",
        "Built and maintained procedural documentation that actually got used, reducing repeat escalations",
        "Managed Microsoft 365 and Active Directory environments across a complex multi-faculty structure",
        "Handled ServiceNow ticketing and escalation paths for infrastructure issues beyond first-line scope"
      ],
      "technologies": [
        "Microsoft 365",
        "Windows Server",
        "Active Directory",
        "ITIL",
        "ServiceNow"
      ]
    },
    {
      "position": "Director",
      "company": "Digital Agency PTY LTD",
      "location": "Australia",
      "period": "2015 - 2018",
      "type": "Concurrent",
      "description": "Ran a small digital agency focused on nonprofits and small businesses — Google Grants, AdWords, Analytics, and web presence. Learned quickly that clients don't buy strategy; they buy outcomes they can point to.",
      "achievements": [
        "Built and managed Google Ad Grants campaigns for nonprofits, maximising the $10k/month allowance to drive real audience growth",
        "Set up Analytics and conversion tracking from scratch for clients with no prior measurement — made their spend legible",
        "Delivered web and campaign work across diverse sectors: environmental orgs, health practitioners, retail",
        "Managed client relationships end-to-end: scoping, delivery, reporting, iteration"
      ],
      "technologies": [
        "Google Analytics",
        "Google AdWords",
        "Bing Ads",
        "Digital Marketing",
        "Campaign Management"
      ]
    },
    {
      "position": "Second Level IT Support Engineer",
      "company": "The Wilderness Society Inc.",
      "location": "Australia",
      "period": "2012 - 2015",
      "type": "Full-time",
      "description": "End-to-end IT infrastructure ownership for a national environmental organisation with distributed operations across Australia. Responsible for all server environments, network infrastructure, and communication systems — the kind of breadth that builds genuine systems thinking.",
      "achievements": [
        "Owned lifecycle management of 60+ Windows/Debian/Ubuntu servers across a nationally distributed organisation",
        "Maintained heterogeneous network infrastructure with no dedicated team — full-stack from physical layer to application",
        "Built and administered Google Apps and VOIP PBX infrastructure replacing legacy systems",
        "Executed complex migrations and decommissioning with zero data loss across diverse environments",
        "Delivered ICT capability to teams with no technical background, building organisational resilience"
      ],
      "technologies": [
        "Windows Server",
        "Debian/Ubuntu",
        "Network Infrastructure",
        "Google Apps",
        "VOIP PBX",
        "Server Management"
      ]
    },
    {
      "position": "Actions Unit — Communications & Logistics Coordinator",
      "company": "Greenpeace Australia Pacific",
      "location": "Australia",
      "period": "2010 - 2012",
      "type": "Full-time",
      "description": "Operational planning and execution for Greenpeace Australia Pacific's direct action campaigns. The Actions unit operates against well-resourced opponents — corporations and state actors who actively work to prevent campaign success. Work required genuine operational security, adversarial threat modeling, and risk assessment under conditions where failure meant people getting hurt or arrested.",
      "achievements": [
        "Planned and coordinated direct action operations — logistics, communications, and security across multiple simultaneous campaigns",
        "Developed threat models and operational security protocols against adversarial opponents with surveillance and legal resources",
        "Designed and maintained field ICT infrastructure for covert operations: encrypted comms, dead drops, secure channels under active counter-surveillance",
        "Conducted pre-action risk assessments enumerating failure modes, contingency routes, and abort criteria",
        "Trained activists in operational security and secure communications under pressure",
        "Coordinated multi-team logistics across geographically distributed operations with real-time adaptation to adversarial conditions"
      ],
      "technologies": [
        "Operational Security",
        "Threat Modeling",
        "Risk Assessment",
        "Encrypted Communications",
        "Field ICT",
        "Logistics Coordination",
        "Adversarial Planning"
      ]
    }
  ],
  "projects": [
    {
      "name": "This Wasn't in the Brochure",
      "subtitle": "Published Book — Co-Parenting Neurodivergent Children",
      "description": "Practical, neurodiversity-affirming guide for co-parents raising children with ADHD, Autism, PDA, and ODD. The first book written specifically for the co-parenting context. Four localised editions (AU, US, UK, NZ) with culturally-appropriate legal, medical, and educational systems. Companion children's book in development.",
      "technologies": [
        "Technical Writing",
        "Neurodiversity",
        "Research Synthesis"
      ],
      "url": "https://thiswasntinthebrochure.wtf",
      "status": "Published",
      "period": "2025 - Present"
    },
    {
      "name": "NotebookLM Automation",
      "subtitle": "CLI Tooling for Google NotebookLM",
      "description": "CLI automation toolkit for Google NotebookLM with research quality controls, deterministic exports, template engine, JSON schema validation, and comprehensive integration testing.",
      "technologies": [
        "Bash",
        "Python",
        "CI/CD",
        "JSON Schema"
      ],
      "github": "https://github.com/adrianwedd/notebooklm-automation",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "Orbitr",
      "subtitle": "AI Music Sequencer",
      "description": "Multi-track polyphonic AI sequencer with concentric ring interface. Inspired by Playtronica's Orbita, enhanced with Meta's MusicGen for real-time sample generation. 36 issues tracked across phased delivery.",
      "technologies": [
        "HTML/CSS/JS",
        "MusicGen",
        "Web Audio API"
      ],
      "github": "https://github.com/adrianwedd/orbitr",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "Evolve Evolution",
      "subtitle": "Multi-Site Healthcare Digital Presence",
      "description": "Four-site digital presence for a healthcare practitioner: AHPRA-compliant chiropractic clinic site, coaching/personal brand platform, author hub, and business evolution site. Shared CSS design token system, Cliniko API integration for appointment management, GA4-to-GTM analytics migration, Cloudflare Pages deployment with serverless functions, and quarterly regulatory compliance workflow. 170+ issues tracked across phased delivery.",
      "technologies": [
        "HTML/CSS/JS",
        "Cloudflare Pages",
        "Cliniko API",
        "GA4/GTM",
        "Structured Data"
      ],
      "status": "Client Delivery",
      "period": "2025 - Present"
    },
    {
      "name": "Tanda Pizza",
      "subtitle": "Localized Restaurant Website",
      "description": "Static website for a Bali-based restaurant, localized to 5 languages with WhatsApp ordering integration and gluten-free menu filtering.",
      "technologies": [
        "HTML/CSS/JS",
        "i18n",
        "WhatsApp API"
      ],
      "status": "Client Delivery",
      "period": "2026"
    },
    {
      "name": "Failure-First Embodied AI",
      "subtitle": "AI Safety Red-Teaming Framework",
      "description": "Red-teaming and benchmarking framework for embodied and agentic AI systems. Focused on adversarial testing, recursive failure analysis, recovery evaluation, and human-in-the-loop safety. Includes computer vision vulnerability research on VLA models, neural network robustness evaluation, automated attack adapters (TAP), cross-modal failure analysis, prompt injection and jailbreak testing, bias detection, interpretability analysis, model evaluation pipelines, and AI ethics documentation.",
      "technologies": [
        "Python",
        "AI Safety",
        "Red-teaming",
        "Adversarial Testing",
        "Computer Vision",
        "Neural Networks",
        "Model Evaluation",
        "AI Ethics",
        "Prompt Injection",
        "Bias Detection",
        "Robustness",
        "Interpretability",
        "Evaluation Framework",
        "Content Safety",
        "Responsible AI",
        "Deep Learning",
        "NotebookLM",
        "arXiv"
      ],
      "github": "https://github.com/adrianwedd/failure-first-embodied-ai",
      "status": "Active Research",
      "period": "2025 - Present"
    },
    {
      "name": "TEL3SIS",
      "subtitle": "Voice-First Agentic Phone System",
      "description": "Real-time telephony platform with LLM-powered conversations, tool use (calendar, SMS, email), tri-layer memory (Redis/SQLite/vectors), safety oracle for pre-execution checks, and human handoff. Built on vocode-python with Whisper, GPT-4, and ElevenLabs.",
      "technologies": [
        "Python",
        "Vocode",
        "Whisper",
        "Redis",
        "Docker"
      ],
      "github": "https://github.com/adrianwedd/TEL3SIS",
      "status": "Active Development",
      "period": "2024 - Present"
    },
    {
      "name": "Cygnet",
      "subtitle": "AI-Powered 3D Printed Housing Ecosystem",
      "description": "Multi-agent platform coordinating land acquisition, build planning, and 3D print operations for affordable housing. 28+ specialized agents, FastAPI backend, React frontend. 795 issues tracked, 432 commits across Python, TypeScript, Kotlin, and Swift.",
      "technologies": [
        "Python",
        "FastAPI",
        "React",
        "TypeScript",
        "Docker"
      ],
      "github": "https://github.com/adrianwedd/cygnet",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "VERITAS",
      "subtitle": "AI-Native Legal Intelligence Platform",
      "description": "Legal intelligence platform addressing the efficiency-trust deficit in the legal market. Knowledge graph with Cypher queries, document analysis pipeline, and transparency-first AI reasoning. 230 issues, 784 commits across Python, TypeScript, and Jupyter notebooks.",
      "technologies": [
        "Python",
        "TypeScript",
        "Neo4j/Cypher",
        "Jupyter",
        "Docker"
      ],
      "github": "https://github.com/adrianwedd/VERITAS",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "ADHDo",
      "subtitle": "Neurodiversity-Affirming AI Assistant",
      "description": "AI assistant for ADHD executive function support with crisis detection, circuit breaker psychology, and local-first processing. NDIS-aware for Australian users. 100 issues, 73 commits.",
      "technologies": [
        "Python",
        "AI Safety",
        "Accessibility"
      ],
      "github": "https://github.com/adrianwedd/ADHDo",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "NeuroConnect",
      "subtitle": "ADHD Support Ecosystem with AI Integration",
      "description": "24/7 voice helpline with wired STT-to-LLM-to-TTS pipeline over Twilio, NDIS evidence logging, and executive function scaffolding. Multi-provider LLM fallback chain including Claude CLI.",
      "technologies": [
        "Python",
        "Twilio",
        "Whisper",
        "Docker"
      ],
      "github": "https://github.com/adrianwedd/neuroconnect",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "RLM-MCP",
      "subtitle": "Recursive Language Model MCP Server",
      "description": "MCP server enabling Claude Code to process 1M+ character documents through session-based chunking, BM25 search, and artifact provenance tracking.",
      "technologies": [
        "Python",
        "MCP",
        "BM25",
        "Claude Code"
      ],
      "github": "https://github.com/adrianwedd/rlm-mcp",
      "status": "Active Development",
      "period": "2025 - Present"
    },
    {
      "name": "Agentic Research Engine",
      "subtitle": "Multi-Agent Research System",
      "description": "Next-generation multi-agent research system with LangGraph orchestration, self-correction loops, and autonomous learning. 1,001 commits across Python with CI/CD cost optimization and enterprise security integration.",
      "technologies": [
        "Python",
        "LangGraph",
        "Multi-Agent Systems",
        "Docker"
      ],
      "github": "https://github.com/adrianwedd/agentic-research-engine",
      "status": "Active Development",
      "period": "2025 - Present"
    }
  ],
  "skills": [
    {
      "name": "Python",
      "category": "Programming Languages",
      "tier": "Primary",
      "description": "AI/ML development, automation scripting, backend services"
    },
    {
      "name": "JavaScript",
      "category": "Programming Languages",
      "tier": "Primary",
      "description": "Frontend and Node.js development, automation"
    },
    {
      "name": "TypeScript",
      "category": "Programming Languages",
      "tier": "Secondary",
      "description": "Type-safe application development"
    },
    {
      "name": "PowerShell",
      "category": "Programming Languages",
      "tier": "Secondary",
      "description": "Windows automation and systems administration"
    },
    {
      "name": "LLM Integration",
      "category": "AI & Automation",
      "tier": "Primary",
      "description": "Large language models (LLMs), Claude API, Anthropic SDK, LangChain, LangGraph, prompt engineering, RAG, retrieval-augmented generation, fine-tuning, multi-agent systems, NLP"
    },
    {
      "name": "AI Safety & Evaluation",
      "category": "AI & Automation",
      "tier": "Primary",
      "description": "Red-teaming, adversarial testing, evaluation frameworks, model evaluation, hallucination detection, content safety, AI ethics, responsible AI, failure-first methodology, transformer and BERT-based evaluation"
    },
    {
      "name": "Process Automation",
      "category": "AI & Automation",
      "tier": "Primary",
      "description": "Workflow automation, scripting, CI/CD pipelines"
    },
    {
      "name": "Systems Integration",
      "category": "Infrastructure",
      "tier": "Primary",
      "description": "API development, data exchange, service integration"
    },
    {
      "name": "Cybersecurity",
      "category": "Infrastructure",
      "tier": "Primary",
      "description": "Penetration testing, vulnerability assessment, threat modeling, identity and access management (IDAM), Essential Eight, ISO 27001, Zero Trust, network security, information security"
    },
    {
      "name": "Linux/Windows Server",
      "category": "Infrastructure",
      "tier": "Primary",
      "description": "Server management, networking, infrastructure"
    },
    {
      "name": "Docker",
      "category": "DevOps",
      "tier": "Secondary",
      "description": "Containerization and development environments"
    },
    {
      "name": "GitHub Actions",
      "category": "DevOps",
      "tier": "Primary",
      "description": "CI/CD pipeline design and automation"
    },
    {
      "name": "ML Libraries",
      "category": "AI & Automation",
      "tier": "Secondary",
      "description": "PyTorch, Hugging Face Transformers, Scikit-learn, NumPy, Pandas, spaCy — deep learning, neural networks, transformer-based evaluation, and classical ML across research and agentic projects"
    },
    {
      "name": "MCP Development",
      "category": "AI & Automation",
      "tier": "Secondary",
      "description": "Model Context Protocol servers for Claude Code integration"
    },
    {
      "name": "Voice/Telephony AI",
      "category": "AI & Automation",
      "tier": "Secondary",
      "description": "STT/TTS pipelines, vocode, Whisper, ElevenLabs"
    },
    {
      "name": "Cloudflare Pages",
      "category": "DevOps",
      "tier": "Secondary",
      "description": "Static site deployment, serverless functions, email routing"
    },
    {
      "name": "React",
      "category": "Frontend",
      "tier": "Secondary",
      "description": "Frontend application development"
    },
    {
      "name": "SQL / PostgreSQL",
      "category": "Data",
      "tier": "Primary",
      "description": "Database design, querying, and optimization"
    }
  ],
  "achievements": [
    {
      "icon": "🏛️",
      "title": "Security & Systems Uplift — Homes Tasmania",
      "description": "Led cybersecurity and systems integration for Tasmania's public housing sector: Essential Eight compliance uplift, penetration testing, IDAM controls, and RESTful API integrations for the Housing Management System. Infrastructure that vulnerable people depend on — the stakes made the work serious.",
      "date": "2018-2024",
      "category": "Technical Achievement"
    },
    {
      "icon": "🤖",
      "title": "AI Safety Research & Red-Teaming",
      "description": "Developed failure-first red-teaming framework for embodied AI systems with 104 tracked research issues, cross-modal vulnerability analysis on VLA models, and automated attack adapters. Pursuing commercial AI safety services.",
      "date": "2025-2026",
      "category": "Research"
    },
    {
      "icon": "📞",
      "title": "Voice-First AI Agent Platform",
      "description": "Built TEL3SIS, a real-time telephony platform with LLM-powered conversations, tri-layer memory architecture, safety oracle, and tool orchestration across 226 tracked issues.",
      "date": "2024-2026",
      "category": "Innovation"
    },
    {
      "icon": "🌿",
      "title": "Technology for High-Stakes Campaigns",
      "description": "Maintained distributed IT infrastructure across The Wilderness Society's national operations and built field technology for Greenpeace direct actions — two very different threat models, both requiring the infrastructure to be invisible until it isn't.",
      "date": "2010-2015",
      "category": "Social Impact"
    }
  ],
  "education": [
    {
      "degree": "Self-Directed AI & Machine Learning Study",
      "institution": "Independent Study",
      "period": "2018 - Present",
      "description": "Ongoing self-directed learning covering AI/ML, autonomous systems, and emerging technologies through courses, research, and building projects.",
      "key_areas": [
        "Multi-Agent Systems",
        "Large Language Models (LLMs)",
        "Prompt Engineering",
        "Retrieval-Augmented Generation (RAG)",
        "Natural Language Processing (NLP)",
        "AI Safety & Evaluation",
        "Red-teaming",
        "Adversarial Testing",
        "Responsible AI",
        "Reinforcement Learning from Human Feedback (RLHF)"
      ]
    },
    {
      "degree": "Computer Science Foundation",
      "institution": "Self-Taught & Professional Experience",
      "period": "2014 - 2018",
      "description": "Built computer science foundation through self-study and professional projects.",
      "key_areas": [
        "Software Engineering",
        "System Design",
        "Database Systems",
        "Network Administration"
      ]
    }
  ],
  "certifications": [
    {
      "name": "Google Analytics Individual Qualification",
      "issuer": "Google",
      "date": "2015",
      "status": "Completed"
    },
    {
      "name": "Google AdWords Certification",
      "issuer": "Google",
      "date": "2015",
      "status": "Completed"
    },
    {
      "name": "Bing Ads Accredited Professional",
      "issuer": "Microsoft",
      "date": "2015",
      "status": "Completed"
    }
  ],
  "languages": [
    {
      "language": "English",
      "proficiency": "Native",
      "level": "C2"
    }
  ],
  "interests": [
    "AI Safety & Evaluation",
    "Multi-Agent Systems",
    "Human-AI Collaboration",
    "Sustainable Technology",
    "Open Source Development",
    "Technology Ethics"
  ]
}
